dot-emacs-dot-d/config.org
#+TITLE: Emacs Config
#+AUTHOR: Akash Agrawal
#+EMAIL: akagr@outlook.com
#+PROPERTY: header-args :results silent :tangle "./init.el"
#+STARTUP: content
#+babel: :cache yes

* Quick keybindings for memory

|------------+---------------------------------------------|
| Keybinding | Explanation                                 |
|------------+---------------------------------------------|
| C-c C-c    | Execute code block                          |
| C-c C-o    | Open source block result                    |
| C-c C-,    | Insert structure template (Eg: Code blocks) |
| C-c '      | Edit the current source code block          |
| srcel<TAB> | Insert elisp code block                     |
|------------+---------------------------------------------|

* Early Init
:properties:
:header-args+: :tangle "./early-init.el"
:end:

*** Defer Compilation
#+BEGIN_SRC emacs-lisp
  (defvar comp-deferred-compilation)
  (setq comp-deferred-compilation t)
#+END_SRC

*** Speed Boost
#+BEGIN_SRC emacs-lisp
  (setq package-enable-at-startup nil
        frame-inhibit-implied-resize t)
#+END_SRC

*** Reduce GC
Following [[https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly][Doom-Emacs FAQ]], we max the garbage collection threshold on startup, and reset it to the original value after.
#+BEGIN_SRC emacs-lisp
  ;; max memory available for gc on startup
  (defvar aa/gc-cons-threshold 16777216)
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold aa/gc-cons-threshold
                    gc-cons-percentage 0.1)))

  ;; max memory available for gc when opening minibuffer
  (defun aa/defer-garbage-collection-h ()
    (setq gc-cons-threshold most-positive-fixnum))

  (defun aa/restore-garbage-collection-h ()
    ;; Defer it so that commands launched immediately after will enjoy the
    ;; benefits.
    (run-at-time
     1 nil (lambda () (setq gc-cons-threshold aa/gc-cons-threshold))))

  (add-hook 'minibuffer-setup-hook #'aa/defer-garbage-collection-h)
  (add-hook 'minibuffer-exit-hook #'aa/restore-garbage-collection-h)
  (setq garbage-collection-messages nil)
#+END_SRC

Temporarily avoid special handling of files
#+BEGIN_SRC emacs-lisp
  (defvar aa/-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq file-name-handler-alist aa/-file-name-handler-alist)))
#+END_SRC

*** Disable Site Run
#+BEGIN_SRC emacs-lisp
  (setq site-run-file nil)
#+END_SRC

*** Don't compact font caches
#+BEGIN_SRC emacs-lisp
  (setq inhibit-compacting-font-caches t)
#+END_SRC

*** Improve I/O
Optimizations for improving I/O performance. Increase max bytes read from a sub-process in a single op (Emacs 27+)
#+BEGIN_SRC emacs-lisp
  (when (boundp 'read-process-output-max)
    ;; 1MB in bytes, default 4096 bytes
    (setq read-process-output-max 1048576))
#+END_SRC

*** Straight.el
[[https://github.com/raxod502/straight.el][straight.el]] is used to download packages for us from all over the web. It stores them all in their respective git folders in =.emacs.d/straight=, which makes debugging, and contributing fixes back upstream as easy as possible.

Updating some settings so straight.el can play nicely with use-package.
#+BEGIN_SRC emacs-lisp
(setq straight-use-package-by-default t
      straight-cache-autoloads t
      straight-vc-git-default-clone-depth 1
      vc-follow-symlinks t)
#+END_SRC

Enable debugging on error.
#+BEGIN_SRC emacs-lisp
  (setq debug-on-error t)
#+END_SRC

Fetching =straight.el=.
#+BEGIN_SRC emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  (setq vc-follow-symlinks 'ask) ; restore default
#+END_SRC

Loading an optional package which gives us some convenience functions, like ~straight-x-clean-unused-repo~ to remove any packages we don't have configured anymore.
#+begin_src emacs-lisp
  (require 'straight-x)
#+end_src

Installing =use-package= now.
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'use-package)
#+END_SRC

*** Use the garbage collector magic hack
#+begin_src emacs-lisp
  (use-package gcmh
    :demand t
    :config (gcmh-mode 1))
  #+end_src
*** End early init
#+BEGIN_SRC emacs-lisp
  (provide 'early-init)
#+END_SRC

* External Dependencies

- Download ~elixir-ls~ from https://github.com/JakeBecker/elixir-ls and adjust the path of language server in eglot config.

* Bootstrapping and Default

Turn off auto backup files, startup message and other more sensible defaults.
#+BEGIN_SRC emacs-lisp
  (setq
   auto-save-default nil
   create-lockfiles nil
   make-backup-files nil
   inhibit-startup-message t
   load-prefer-newer t
   ring-bell-function 'ignore
   sentence-end-double-space nil
   confirm-kill-processes nil)
#+END_SRC

Don't use tabs for indentation. Also truncate lines instead of wrapping them.
#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil
                truncate-lines t)
#+END_SRC

Use y or n instead of yes or no. Additionally, use ibuffers to be consistent with buffer management and not having to worry about wrong key chords.
#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
  (defalias 'list-buffers 'ibuffer)
#+END_SRC

Turn off all the chrome that emacs puts by default.
#+BEGIN_SRC emacs-lisp
  (progn
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (menu-bar-mode -1)
    (tooltip-mode -1))
#+END_SRC

A few modes are turned on by default
#+BEGIN_SRC emacs-lisp
  (global-so-long-mode) ;; handles really long lines well
  (electric-pair-mode) ;; auto matching brackets, parentheses etc.
  (show-paren-mode) ;; show matching opening/closing parentheses
  (column-number-mode) ;; show column number in mode line
  (global-display-line-numbers-mode) ;; show line numbers in all buffers
#+END_SRC

Make the command key behave as 'meta' on macOS.
#+BEGIN_SRC emacs-lisp
  (when (eq system-type 'darwin)
    (setq mac-option-key-is-meta nil
          mac-command-key-is-meta t
          mac-command-modifier 'meta
          mac-option-modifier 'super))
#+END_SRC

Delete whitespace on save
#+BEGIN_SRC emacs-lisp
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (add-hook 'after-change-major-mode-hook
            (lambda ()
              (modify-syntax-entry ?_ "w")))
#+END_SRC

* Support Packages

Loading emacs from finder or spotlight causes it to not load many environment variables. This package fixes it.
#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell
    :config
    (exec-path-from-shell-initialize))
#+END_SRC

Various packages that are used by numerous other packages.
+ `which-key` allows using keybindings interactively. For example, if `<leader>gs` is mapped to `magit-status`, and I press only `<leader>g`, it'll show all the keys and commands that are valid follows.
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :diminish
    :config
    (which-key-mode)
    (which-key-setup-side-window-bottom)
    :custom (which-key-idle-delay 0.3))
#+END_SRC

Simplify leader bindings with general.el.
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-evil-setup t)

    (general-create-definer aa/leader-key-def
      :keymaps '(normal insert visual emacs)
      :prefix ","
      :global-prefix "C-,"))
#+end_src
* Common Keybindings

#+BEGIN_SRC emacs-lisp
  (aa/leader-key-def
    "e"  '(:ignore t :which-key "emacs")
    "ee" '((lambda () (interactive) (find-file "~/.emacs.d/config.org")) :which-key "open config")
    "er" '((lambda () (interactive) (load-file user-init-file)) :which-key "reload config")
    "ek" '(kill-emacs :which-key "kill emacs")

    "h"  '(help-command :which-key "help")

    "t"  '(:ignore t :which-key "toggle")
    "tt" '(counsel-load-theme :which-key "theme")
    "tw" '(toggle-truncate-lines :which-key "wrap lines")

    "c"  '(:ignore t :which-key "code")
    "cc" '(xref-find-definitions :which-key "find definitions")
    "cr" '(xref-find-references :which-key "find references"))
#+END_SRC

* Appearance

Set default frame height.
#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(width . 200))
  (add-to-list 'default-frame-alist '(height . 48))
#+END_SRC

Use ~Fira Code~ font with ligatures. Install the symbol font with ~M-x fira-code-mode-intall-fonts~. This is non-optional, and is required even after installing ~Fira Code~ to the system. Restart emacs after installing symbol fonts.
#+BEGIN_SRC emacs-lisp
  (use-package fira-code-mode
    :demand t
    :diminish
    :custom (fira-code-mode-disabled-ligatures '("[]" "#{" "#(" "#_" "#_(" "x"))
    :hook prog-mode
    :config
    (set-face-attribute 'default nil
                        :family "FiraCode Nerd Font"
                        :height 130
                        :weight 'normal))

  (use-package rainbow-delimiters
    :hook ((prog-mode . rainbow-delimiters-mode)))

  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-dracula t))
#+END_SRC

Load theme after creating a new frame. This is required to work with server/client model. Otherwise, emacs will load theme only once when starting server and all subsequent frames won't get the theme.
#+BEGIN_SRC emacs-lisp
  (add-hook 'after-make-frame-functions
            (lambda (frame)
              (with-selected-frame frame
                (load-theme 'doom-dracula t))))
#+END_SRC

Config for mode line:
#+begin_src emacs-lisp
  ;; Diminish minor modes from mode line
  (use-package diminish
    :config
    (diminish 'org-indent-mode)
    (diminish 'buffer-face-mode)
    (diminish 'visual-line-mode)
    (diminish 'eldoc-mode)
    (diminish 'auto-revert-mode))
#+end_src

