dot-emacs-dot-d/init.el
(setq
 auto-save-default nil
 create-lockfiles nil
 make-backup-files nil
 inhibit-startup-message t
 load-prefer-newer t
 ring-bell-function 'ignore
 sentence-end-double-space nil
 confirm-kill-processes nil)

(setq-default indent-tabs-mode nil
              truncate-lines t)

(defalias 'yes-or-no-p 'y-or-n-p)
(defalias 'list-buffers 'ibuffer)

(progn
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (tooltip-mode -1))

(global-so-long-mode) ;; handles really long lines well
(electric-pair-mode) ;; auto matching brackets, parentheses etc.
(show-paren-mode) ;; show matching opening/closing parentheses
(column-number-mode) ;; show column number in mode line
(global-display-line-numbers-mode) ;; show line numbers in all buffers

(when (eq system-type 'darwin)
  (setq mac-option-key-is-meta nil
        mac-command-key-is-meta t
        mac-command-modifier 'meta
        mac-option-modifier 'super))

(add-hook 'before-save-hook 'delete-trailing-whitespace)

(add-hook 'after-change-major-mode-hook
          (lambda ()
            (modify-syntax-entry ?_ "w")))

(use-package exec-path-from-shell
  :config
  (exec-path-from-shell-initialize))

(use-package which-key
  :diminish
  :config
  (which-key-mode)
  (which-key-setup-side-window-bottom)
  :custom (which-key-idle-delay 0.3))

(use-package general
  :config
  (general-evil-setup t)

  (general-create-definer aa/leader-key-def
    :keymaps '(normal insert visual emacs)
    :prefix ","
    :global-prefix "C-,"))

(aa/leader-key-def
  "e"  '(:ignore t :which-key "emacs")
  "ee" '((lambda () (interactive) (find-file "~/.emacs.d/config.org")) :which-key "open config")
  "er" '((lambda () (interactive) (load-file user-init-file)) :which-key "reload config")
  "ek" '(kill-emacs :which-key "kill emacs")

  "h"  '(help-command :which-key "help")

  "t"  '(:ignore t :which-key "toggle")
  "tt" '(counsel-load-theme :which-key "theme")
  "tw" '(toggle-truncate-lines :which-key "wrap lines")

  "c"  '(:ignore t :which-key "code")
  "cc" '(xref-find-definitions :which-key "find definitions")
  "cr" '(xref-find-references :which-key "find references"))

(add-to-list 'default-frame-alist '(width . 200))
(add-to-list 'default-frame-alist '(height . 48))

(use-package fira-code-mode
  :demand t
  :diminish
  :custom (fira-code-mode-disabled-ligatures '("[]" "#{" "#(" "#_" "#_(" "x"))
  :hook prog-mode
  :config
  (set-face-attribute 'default nil
                      :family "FiraCode Nerd Font"
                      :height 130
                      :weight 'normal))

(use-package rainbow-delimiters
  :hook ((prog-mode . rainbow-delimiters-mode)))

(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-dracula t))

(add-hook 'after-make-frame-functions
          (lambda (frame)
            (with-selected-frame frame
              (load-theme 'doom-dracula t))))

;; Diminish minor modes from mode line
(use-package diminish
  :config
  (diminish 'org-indent-mode)
  (diminish 'buffer-face-mode)
  (diminish 'visual-line-mode)
  (diminish 'eldoc-mode)
  (diminish 'auto-revert-mode))
