dot-emacs-dot-d/init.el

(use-package undo-fu)

(use-package evil
  :init
  (setq evil-respect-visual-line-mode t
        evil-undo-system 'undo-fu
        evil-want-integration t
        evil-want-keybinding nil)
  :config
  (evil-mode)
  (setq evil-emacs-state-modes (delq 'ibuffer-mode evil-emacs-state-modes)
        evil-emacs-state-cursor '("indian red" box)
        evil-normal-state-cursor '("indian red" box)
        evil-visual-state-cursor '("royal blue" box)
        evil-insert-state-cursor '("yellow green" bar)
        evil-replace-state-cursor '("red" bar)
        evil-operator-state-cursor '("red" hollow)))

(use-package evil-commentary
  :after evil
  :diminish
  :config
  (evil-commentary-mode))

(use-package evil-surround
  :after evil
  :config
  (global-evil-surround-mode 1))

(use-package evil-collection
  :init
  (evil-collection-init '(deadgrep dired dired-sidebar ediff ibuffer magit vterm xref)))

(with-eval-after-load 'org
  (setq org-directory "~/Dropbox/org"
        org-default-notes-file (concat org-directory "/notes.org")
        org-agenda-files '("~/Dropbox/org/")
        org-archive-location (concat org-directory "/archive/%s::")))

(aa/leader-key-def
  "r"  '(:ignore t :which-key "org mode")
  "ra" '(org-agenda :which-key "agenda")
  "rc" '(org-capture :which-key "capture")
  "ri" '((lambda () (interactive) (org-indent-block)) :which-key "indent block")
  "rl" '(org-store-link :which-key "store Link")
  "ro" '((lambda () (interactive) (find-file org-default-notes-file)) :which-key "open notes")
  "rp" '(org-present :which-key "present")
  "rt" '(org-babel-tangle :which-key "tangle"))

(with-eval-after-load 'org
  (setq org-startup-indented t
        org-hide-emphasis-markers t
        org-fontify-done-headline t
        org-hide-leading-stars t
        org-pretty-entities t
        org-src-tab-acts-natively t
        org-odd-levels-only t
        truncate-lines nil)
  (add-hook 'org-mode-hook #'visual-line-mode)
  (add-hook 'org-mode-hook #'variable-pitch-mode)
  (add-hook 'org-babel-after-execute-hook #'org-redisplay-inline-images))

(use-package org-bullets
  :custom
  (org-bullets-bullet-list '("◉" "☯" "○" "☯" "✸" "☯" "✿" "☯" "✜" "☯" "◆" "☯" "▶"))
  (org-ellipsis " ▶")
  :hook (org-mode . org-bullets-mode))

(use-package evil-org
  :diminish
  :commands evil-org-mode
  :init
  (add-hook 'org-mode-hook #'evil-org-mode)
  (add-hook 'evil-org-mode-hook
            (lambda ()
              (evil-org-set-key-theme)))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(add-hook 'after-make-frame-functions
          (lambda (frame)
            (with-selected-frame frame
              (progn
                (let* ((variable-tuple
                        (cond ((x-list-fonts "FiraCode Nerd Font") '(:font "FiraCode Nerd Font"))
                              (nil (warn "Cannot find Firacode. Install FiraCode Nerd Font."))))
                       (base-font-color   (face-foreground 'default nil 'default))
                       (headline         `(:inherit default :weight bold :foreground ,base-font-color)))

                  (custom-theme-set-faces
                   'user
                   `(org-level-8 ((t (,@headline ,@variable-tuple))))
                   `(org-level-7 ((t (,@headline ,@variable-tuple))))
                   `(org-level-6 ((t (,@headline ,@variable-tuple))))
                   `(org-level-5 ((t (,@headline ,@variable-tuple))))
                   `(org-level-4 ((t (,@headline ,@variable-tuple))))
                   `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.1))))
                   `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.25))))
                   `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.5))))
                   `(org-document-title ((t (,@headline ,@variable-tuple :height 1.75 :underline nil)))))))

              (custom-theme-set-faces
               'user
               '(variable-pitch ((t (:family "FiraCode Nerd Font" :height 140 :weight normal))))
               '(fixed-pitch ((t ( :family "FiraCode Nerd Font" :height 130))))))))

(add-hook 'after-make-frame-functions
          (lambda (frame)
            (with-selected-frame frame
              (custom-theme-set-faces
               'user
               '(org-block ((t (:inherit fixed-pitch))))
               '(org-code ((t (:inherit (shadow fixed-pitch)))))
               '(org-document-info ((t (:foreground "dark orange"))))
               '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
               '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
               '(org-link ((t (:foreground "royal blue" :underline t))))
               '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
               '(org-property-value ((t (:inherit fixed-pitch))) t)
               '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
               '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
               '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 1))))
               '(org-verbatim ((t (:inherit (shadow fixed-pitch)))))))))

(setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "†")
                                       ("#+END_SRC" . "†")
                                       ("#+begin_src" . "†")
                                       ("#+end_src" . "†")))
(setq prettify-symbols-unprettify-at-point t)
(add-hook 'org-mode-hook 'prettify-symbols-mode)

(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

(font-lock-add-keywords 'org-mode
                        '(("^ *\\([+]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◦"))))))

(use-package org-present
  :config
  (add-hook 'org-present-mode-hook
               (lambda ()
                 (display-line-numbers-mode -1)
                 (org-display-inline-images)
                 (org-present-hide-cursor)
                 (org-present-read-only)))
     (add-hook 'org-present-mode-quit-hook
               (lambda ()
                 (display-line-numbers-mode +1)
                 (org-remove-inline-images)
                 (org-present-show-cursor)
                 (org-present-read-write))))

(use-package ivy
  :diminish
