dot-emacs-dot-d/config.org
* Better UX for Menus - Ivy and Bros.

Ivy allows me to use fuzzy find files, M-x commands, subdirectories, buffers. It provides the backend which many packages end up using. Alternatives would be helm and ido, which I've not yet tried.

#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :diminish
    :bind (:map ivy-minibuffer-map
                ("TAB" . ivy-alt-done)
                ("C-l" . ivy-alt-done)
                ("C-j" . ivy-next-line)
                ("C-k" . ivy-previous-line)
                :map ivy-switch-buffer-map
                ("C-j" . ivy-next-line)
                ("C-k" . ivy-previous-line)
                ("C-l" . ivy-done)
                ("C-d" . ivy-switch-buffer-kill)
                :map ivy-reverse-i-search-map
                ("C-j" . ivy-next-line)
                ("C-k" . ivy-previous-line)
                ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers nil
          ivy-initial-inputs-alist nil
          ivy-count-format "(%d/%d) ")
    ;; Don't want to see these buffers in switcher. Rarely,
    ;; if ever have I switched to them.
    (add-to-list 'ivy-ignore-buffers "^magit")
    (add-to-list 'ivy-ignore-buffers "^:") ;; This removes the dired-sidebar buffer from list
    (add-to-list 'ivy-ignore-buffers "\\*Messages\\*")
    (add-to-list 'ivy-ignore-buffers "\\*vterm\\*")
    (add-to-list 'ivy-ignore-buffers "\\*EGLOT")
    (add-to-list 'ivy-ignore-buffers "\\*eldoc*")
    (add-to-list 'ivy-ignore-buffers "\\*Warnings*")
    (add-to-list 'ivy-ignore-buffers "\\*Compile-Log\\*"))
#+END_SRC

[[https://github.com/Yevgnen/ivy-rich][Ivy Rich]] adds some flair to Ivy minibuffer by providing additional details about candidates - major mode, project etc.

#+BEGIN_SRC emacs-lisp
  (use-package ivy-rich
    :after ivy
    :diminish
    :custom
    (ivy-virtual-abbreviate 'full)
    (ivy-rich-switch-buffer-align-virtual-buffer nil)
    (ivy-rich-path-style 'full)
    :config
    (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
    (ivy-rich-mode))
#+END_SRC

[[https://github.com/abo-abo/hydra][Hydra]] allows creating groups of keybindings. I don't use it directly, but packages like Ivy expose additional functionality with it.

#+BEGIN_SRC emacs-lisp
  (use-package hydra)
  (use-package ivy-hydra
    :after (ivy hydra))

#+END_SRC

[[https://github.com/abo-abo/swiper/blob/master/counsel.el][Counsel]] applies Ivy to a lot of areas in emacs - M-x menu, buffer menu etc.

#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :after ivy
    :diminish
    :config
    (counsel-mode t)
    :bind (("M-x" . counsel-M-x)))

  (use-package wgrep)
#+END_SRC

[[https://github.com/raxod502/prescient.el][Prescient.el]] is a package that adds sane sorting and filtering behaviour, and it comes with adapters for popular completion frameworks (including Ivy).

#+BEGIN_SRC emacs-lisp
  (use-package prescient
    :commands prescient-persist-mode
    :init (prescient-persist-mode 1)
    :config
    (setq prescient-filter-method '(literal)
          prescient-sort-full-matches-first nil))

  (use-package ivy-prescient
    :after (counsel counsel-projectile prescient)
    :config
    (ivy-prescient-mode t)
    (setq ivy-prescient-sort-commands t))

#+END_SRC

A few keybindings to command it all.

#+BEGIN_SRC emacs-lisp
  (aa/leader-key-def
  "b" '(:ignore t :which-key "buffer")
  "bb" '(counsel-projectile-switch-to-buffer :which-key "list in project")
  "bc" '(kill-this-buffer :which-key "kill current")
  "bd" '(aa/close-and-kill-this-pane :which-key "close current"))

  (general-define-key
   :states 'normal
   "/" 'swiper)
#+END_SRC
* VCS

The primary git interface I use, and also one of the main reasons I use emacs. `libgit` provides native bindings which makes magit faster.
#+BEGIN_SRC emacs-lisp
  (use-package libgit)

  (use-package magit
    :defer t)

  (use-package magit-libgit
    :after (magit libgit))

  (aa/leader-key-def
    "g" '(:ignore t :which-key "git")
    "gs" '(magit-status :which-key "status")
    "gb" '(magit-blame :which-key "blame"))
#+END_SRC

Set ediff to use the current frame instead of creating a new one.
#+BEGIN_SRC emacs-lisp
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
#+END_SRC

* Project Management

Projectile plays pretty well with the other packages, including magit and dired sidebar.
#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :after evil
    :diminish
    :init
    (setq projectile-completion-system 'ivy)
    :config
    (define-key projectile-mode-map (kbd "M-p") 'projectile-command-map)
    (projectile-mode +1))

  (use-package counsel-projectile
    :after projectile
    :config
    (setq counsel-projectile-sort-files t
          counsel-projectile-sort-projects t
          counsel-projectile-sort-buffers t
          counsel-projectile-sort-directories t))

  (aa/leader-key-def
    "p"  '(projectile-command-map :which-key "projectile")
    "pf" '(counsel-projectile-find-file :which-key "find file"))
#+END_SRC

Perspective allows creation of multiple, independent buffer lists and switch between them.
#+BEGIN_SRC emacs-lisp
  (use-package perspective
    :config
    (unless (equal persp-mode t)
      (persp-mode)))

  (general-define-key
   :states 'normal
   "C-b" 'persp-counsel-switch-buffer)

  (aa/leader-key-def
    "bs" '(persp-switch :which-key "switch perspective")
    "bk" '(persp-kill :which-key "kill perspective")
    "bn" '(persp-next :which-key "next perspective"))
#+END_SRC

* Programming Languages
*** Common Config
#+begin_src emacs-lisp
  (use-package editorconfig
    :diminish
    :config
    (editorconfig-mode 1))
#+end_src

*** Ruby
#+begin_src emacs-lisp
  (use-package ruby-end
    :diminish)
#+end_src
*** Typescript
#+begin_src emacs-lisp
  (use-package typescript-mode
    :defer t
    :config
    (add-to-list 'auto-mode-alist '("\\.tsx?\\'" . typescript-mode)))
#+end_src
*** Elixir
#+BEGIN_SRC emacs-lisp
  (use-package elixir-mode
    :after ruby-end
    :defer t
    :config
    (add-to-list 'elixir-mode-hook
                 (defun auto-activate-ruby-end-mode-for-elixir-mode ()
                   (set (make-variable-buffer-local 'ruby-end-expand-keywords-before-re)
                        "\\(?:^\\|\\s-+\\)\\(?:do\\)")
                   (set (make-variable-buffer-local 'ruby-end-check-statement-modifiers) nil)
                   (ruby-end-mode +1)))
    ;; Create a buffer-local hook to run elixir-format on save, only when we enable elixir-mode.
    (add-hook 'elixir-mode-hook
              (lambda () (add-hook 'before-save-hook 'elixir-format nil t))))
#+END_SRC
*** Kubernetes
#+BEGIN_SRC emacs-lisp
  (use-package kubel
    :defer t)
  (use-package kubel-evil
    :after kubel)

  (aa/leader-key-def
    "k" '(kubel :which-key "k8s"))
#+END_SRC
*** Web
#+begin_src emacs-lisp
  (use-package web-mode
    :mode "\\.p?html?\\'"
    :mode "\\.eex\\'"
    :mode "\\.leex\\'"

    :config
    (setq
     web-mode-markup-indent-offset 2
     web-mode-css-indent-offset 2
     web-mode-code-indent-offset 2
     web-mode-enable-auto-closing t
     web-mode-enable-auto-opening t
     web-mode-enable-auto-pairing t
     web-mode-enable-auto-indentation t)
    )

  (use-package polymode
    :mode ("\\.ex\\'" . poly-elixir-web-mode)
    :config
    (define-hostmode poly-elixir-hostmode :mode 'elixir-mode)
    (define-innermode poly-liveview-expr-elixir-innermode
      :mode 'web-mode
      :head-matcher (rx line-start (* space) "~L" (= 3 (char "\"'")) line-end)
      :tail-matcher (rx line-start (* space) (= 3 (char "\"'")) line-end)
      :head-mode 'host
      :tail-mode 'host
      :allow-nested nil
      :keep-in-mode 'host
      :fallback-mode 'host)
    (define-polymode poly-elixir-web-mode
      :hostmode 'poly-elixir-hostmode
      :innermodes '(poly-liveview-expr-elixir-innermode))
    )

  (setq web-mode-engines-alist '(("elixir" . "\\.ex\\'")))
#+end_src

*** Yaml
#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode)
#+END_SRC

*** Markdown

Enable visual line for word wrap and sane navigation.
#+BEGIN_SRC emacs-lisp
  (add-hook 'markdown-mode-hook #'visual-line-mode)
#+END_SRC

* Snippet Support
Add snippet support. Actual snippets live outside of this file. Custom snippets can be saved in ~~/.emacs.d/snippets~ directory.
#+begin_src emacs-lisp
  (use-package yasnippet
    :after company
    :diminish yas-minor-mode
    :hook (prog-mode . yas-minor-mode)
    :hook (org-mode . yas-minor-mode)
    :config
    (yas-reload-all))

  (use-package yasnippet-snippets
    :after (yasnippet))
#+end_src

* Terminal
Add ~vterm~, the most complete terminal emulator for emacs, and supporting packages.

#+BEGIN_SRC emacs-lisp
  (use-package vterm)

  (use-package vterm-toggle
    :after vterm
    :config
    (setq vterm-toggle-hide-method 'reset-window-configration))

  (general-define-key
   :states 'normal
   "C-t" 'vterm-toggle)

  (evil-collection-define-key 'insert 'vterm-mode-map
      (kbd "C-t") 'vterm-toggle)
#+END_SRC

