dot-emacs-dot-d/config.org
* Code completion and Error Checking

Using company for auto-completion backend. Most modern languages implement LSP (Language Server Protocol), allowing for rich auto-completion.
#+BEGIN_SRC emacs-lisp
  (use-package company
    :diminish
    :init
    (setq company-idle-delay 0)
    (setq company-global-modes '(not org-mode))
    (setq company-minimum-prefix-length 1)
    :config
    (global-company-mode 1))

  (use-package eglot
    :after elixir-mode
    :config
    (add-hook 'elixir-mode-hook 'eglot-ensure)
    (add-hook 'ruby-mode-hook 'eglot-ensure)
    (add-to-list 'eglot-server-programs '(elixir-mode "/Users/akash/Downloads/elixir-ls/language_server.sh")))

  ;; Helps with monorepo project where projects might not be the top level
  (add-hook 'project-find-functions 'aa/find-mix-project nil nil)
  (add-hook 'project-find-functions 'aa/find-rails-project nil nil)

  (use-package flycheck
    :diminish
    :custom
    (flycheck-emacs-lisp-initialize-packages t)
    (flycheck-display-errors-delay 0.1)
    :config
    (global-flycheck-mode)
    (flycheck-set-indication-mode 'left-margin)

    (add-to-list 'flycheck-checkers 'proselint))

  (use-package flycheck-inline
    :config (global-flycheck-inline-mode))
#+END_SRC

* Sidebar
#+BEGIN_SRC emacs-lisp
  (use-package dired-sidebar
    :commands (dired-sidebar-toggle-sidebar)
    :after evil
    :init
    (add-hook 'dired-sidebar-mode-hook
              (lambda ()
                (unless (file-remote-p default-directory)
                  (auto-revert-mode))))

    :config
    (push 'toggle-window-split dired-sidebar-toggle-hidden-commands)
    (push 'rotate-windows dired-sidebar-toggle-hidden-commands)
    (setq dired-sidebar-theme 'icons)
    (setq dired-sidebar-subtree-line-prefix "-")
    (setq dired-sidebar-use-term-integration t)
    (setq dired-sidebar-use-custom-font t))

  (aa/leader-key-def
    "n" '(dired-sidebar-toggle-sidebar :which-key "sidebar"))
#+END_SRC

Run `M-x all-the-icons-install-fonts` to install the icons.
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons)

  (use-package all-the-icons-dired
    :after all-the-icons
    :config
    (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
    (setq all-the-icons-dired-monochrome nil))
#+END_SRC

* General Searching
#+BEGIN_SRC emacs-lisp
  (use-package ripgrep)

  (use-package deadgrep)

  (aa/leader-key-def
    "s" '(deadgrep :which-key "search"))
#+END_SRC

* Custom Functions

Copy current file path relative to project root.
#+BEGIN_SRC emacs-lisp
  (defun aa/copy-file-path ()
    (interactive)
    (kill-new (file-relative-name buffer-file-name (projectile-project-root))))

  (defalias 'copy-file-path 'aa/copy-file-path)
#+END_SRC

Kill this buffer and window, as long as it's not the only window open.
#+begin_src emacs-lisp
  (defun aa/close-and-kill-this-pane ()
    "If there are multiple windows, then close this one and kill its buffer"
    (interactive)
    (kill-this-buffer)
    (if (not (one-window-p))
        (delete-window)))
#+end_src

Add custom methods to correctly locate elixir and rails projects inside a multi-project monorepo.
#+BEGIN_SRC emacs-lisp
  (defun aa/find-mix-project (dir)
    "Try to locate a Elixir project root by 'mix.exs' above DIR."
    (let ((mix_root (locate-dominating-file dir "mix.exs")))
      (message "Found Elixir project root in '%s' starting from '%s'" mix_root dir)
      (if (stringp mix_root) `(transient . ,mix_root) nil)))

  (defun aa/find-rails-project (dir)
    "Try to locate a Rails project root by 'Gemfile' above DIR."
    (let ((rails_root (locate-dominating-file dir "Gemfile")))
      (message "Found Rails project root in '%s' starting from '%s'" rails_root dir)
      (if (stringp rails_root) `(transient . ,rails_root) nil)))
#+END_SRC

* Sources
Huge thanks to these amazing people whose configs I borrowed from:
- [[https://github.com/meatcar/emacs.d/blob/master/config.org][Denys Pavlov]]
- [[https://github.com/daviwil/dotfiles/blob/master/Emacs.org][David Wilson]]
